### Pandas
* Pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool, built on top of the Python programming language.

In [1]:
import pandas as pd

### Series
 * Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively referred to as the index.

In [9]:
fruits = pd.Series(["apple", "pear", "orange", "melon", "kiwi"]) # index=[5, 6, "sju", 8, 9] changes index
fruits

5       apple
6        pear
sju    orange
8       melon
9        kiwi
dtype: object

In [8]:
# apply uses another method on the entire series
fruits.apply(str.upper)

5     APPLE
6      PEAR
7    ORANGE
8     MELON
9      KIWI
dtype: object

In [5]:
numbers = pd.Series([5, 6, 3])
numbers * 2

0    10
1    12
2     6
dtype: int64

In [12]:
fruits[[True, True, False, False, True]]

numbers[numbers >= 5]

0    5
1    6
dtype: int64

### Dataframe
* DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object. Like Series, DataFrame accepts many different kinds of input:

In [14]:
data = {
    "Name" : ["Lucian", "Felix", "Oliver"],
    "Age" : [20, 19, 20]
}

df = pd.DataFrame(data)
df

     Name  Age
0  Lucian   20
1   Felix   19
2  Oliver   20

In [17]:
data = [
    {"Name" : "Lucian", "Age" : 20},
    {"Name" : "Felix", "Age" : 19},
    {"Name" : "Oliver", "Age" : 20}
]

df = pd.DataFrame(data)
df

     Name  Age
0  Lucian   20
1   Felix   19
2  Oliver   20

In [21]:
df["Name"]

0    Lucian
1     Felix
2    Oliver
Name: Name, dtype: object

In [33]:
df["Age"] = df["Age"] + 1
df

     Name  Age
0  Lucian   34
1   Felix   33
2  Oliver   34

In [35]:
str(df)

'     Name  Age\n0  Lucian   34\n1   Felix   33\n2  Oliver   34'

In [36]:
print(df)

     Name  Age
0  Lucian   34
1   Felix   33
2  Oliver   34